{"id":2249,"date":"2020-10-28T07:00:12","date_gmt":"2020-10-28T07:00:12","guid":{"rendered":"https:\/\/yellostack.com\/Meric\/?post_type=courses&#038;p=2249"},"modified":"2020-11-07T08:26:10","modified_gmt":"2020-11-07T08:26:10","slug":"introduction-to-finance-accounting-modeling-and-valuation","status":"publish","type":"courses","link":"https:\/\/yellostack.com\/meric-saudi-arabia\/courses\/introduction-to-finance-accounting-modeling-and-valuation\/","title":{"rendered":"Introduction to Finance, Accounting, Modeling and Valuation"},"content":{"rendered":"<p>Description<br \/>\n#1 Best Selling Accounting Course on Udemy (Learn Finance and Accounting the Easy Way)! ** ACCORDING TO BUSINESS INSIDER: &#8220;Haroun is one of the highest-rated professors on Udemy, so you can expect to be in good hands through the course of your education.&#8221; ** He is the author of the best selling business course on Udemy this year called &#8216;An Entire MBA in 1 Course&#8217;<\/p>\n<p>This course will help you understand accounting, finance, financial modeling, and valuation from scratch (no prior accounting, finance, modeling, or valuation experience is required).<\/p>\n<p>After taking this course you will understand how to create, analyze, and forecast an income statement, balance sheet, and cash flow statement.<\/p>\n<p>By the end of his course, you will also know how to value companies using several different valuation methodologies that I have used during my Wall Street career so you can come up with target prices for the companies that you are analyzing.<\/p>\n<p>By the end of this course, you will also know how to analyze financial statements using many different financial ratios\/formulas that I have used in my hedge fund, Goldman Sachs, and venture capital career.<\/p>\n<p>Lastly, I am teaching this course in a much more visual and entertaining way; I hope you enjoy the course as I always use an &#8216;edutainment&#8217; and visualization teaching approach to make complex topics simple\/easy to understand.<\/p>\n<p>Please note that if you already signed up for my course called &#8220;Hedge and Mutual Fund Careers: The Complete Guide,&#8221; some of the accounting and finance topics in this course were already covered in the Hedge and Mutual Fund Careers: The Complete Guide course.<\/p>\n<p>Thanks<\/p>\n<p>Who this course is for:<br \/>\nAnyone interested in how accounting works (no prior accounting experience is needed).<br \/>\nAnyone interested in how finance works (no prior finance experience is needed).<br \/>\nAnyone interested in how modeling works (no prior modeling experience is needed).<br \/>\nAnyone interested in how valuation works (no prior valuation experience is needed).<br \/>\nAnyone interested in how financial ratios work (no prior financial ratios experience is needed).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>#1 Best Selling Accounting Course on Udemy (Learn Finance and Accounting the Easy Way)!​<br \/>\nAnalyze and understand an income statement (even if you have no experience with income statements).<br \/>\nAnalyze and understand a balance sheet (even if you have no experience with balance sheets).<br \/>\nAnalyze and understand a cash flow statement (even if you have no experience with cash flow statements).<br \/>\nUnderstand and use modeling best practices so you can create financial models.<br \/>\nKnow where to get data in order to build a financial model (in depth understanding of identifying and using\/navigating the best free websites and sources to build your financial model)!<br \/>\nCreate a financial model (projecting the future) for an income statement.<br \/>\nCreate a financial model (projecting the future) for a balance sheet.<br \/>\nCreate a financial model (projecting the future) for a cash flow statement.<br \/>\nUnderstand valuation best practices so you can create target prices based on your financial models.<br \/>\nHow to use Discounted Cash Flow (DCF) and how to create the Weighted Average Cost of Capital and Terminal values in order to pick target prices.<br \/>\nHow to use P\/E in order to pick target prices.<br \/>\nHow to use P\/R in order to pick target prices.<br \/>\nOther valuation methodologies, including EV\/Sales, EV\/EBITDA, P\/B, EV\/FCF, etc.<br \/>\nCome up with a target price based on an average of several different valuation methodologies.<br \/>\nAnalyze the total addressable market for a company you are doing research on.<br \/>\nAnalyze financial statements using profitability ratios: Gross Margin (Cost of Goods Sold \/ Revenue), Operating Margin (EBITDA\/ Revenue), Net Profit Margin (Net Income \/ Revenue), Return on Assets (Net Income \/ Assets) and Return on Equity (Net Income \/ Equity).<br \/>\nAnalyze financial statements using debt and inventory formulas: Debt to Assets (Total Liabilities\/ Total Assets), Debt to Equity (Total Liabilities\/ Total Equity), Interest Coverage Ratio (EBITDA \/ Interest) and Inventory Days on Hand (Inventory \/ Cost of Good Sold) * 365.<br \/>\nAnalyze and compare companies using the following formulas: Price \/ Earnings, PEG (P\/E \/ Growth), Price \/ Revenue, EV\/EBITDA, EV\/Sales, Price\/Free Cash Flow and Price \/ Book.<br \/>\nWe will do an extremely in-depth professional accounting, finance, modeling, and valuation analysis of LinkedIn using the accounting and finance methodologies used in this course (you will also have many exercises to complete that will help you understand accounting, finance, valuation and modeling).<\/p>\n","protected":false},"author":1,"featured_media":2675,"template":"","course-category":[32,34],"course-tag":[9],"_links":{"self":[{"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/courses\/2249"}],"collection":[{"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/courses"}],"about":[{"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/types\/courses"}],"author":[{"embeddable":true,"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/users\/1"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/media\/2675"}],"wp:attachment":[{"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/media?parent=2249"}],"wp:term":[{"taxonomy":"course-category","embeddable":true,"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/course-category?post=2249"},{"taxonomy":"course-tag","embeddable":true,"href":"https:\/\/yellostack.com\/meric-saudi-arabia\/wp-json\/wp\/v2\/course-tag?post=2249"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}